
[
  {
    "title": "Rocket Rush | Betting App",
    "tools": "React Native | Expo",
    "link":"https://www.youtube.com/watch?v=McLAFSQYvzo",
    "img" : "https://raw.githubusercontent.com/dananjaya6005/dhananjaya.tech/main/src/post%20thumbnail/Rocket_rush.png",
    "description": "RocketRush is a unique mobile game where users bet on the flight duration of a rocket that can crash anytime within the first 10 seconds. The longer the flight, the higher the winnings. Developed using React Native and Expo CLI, RocketRush offers a simple yet suspenseful gaming experience. We envision it evolving into a platform with various themes and game modes for a unique gaming experience. "
    
  },

  {
    "title": "Gift of Hope",
    "tools": "React + Supabase + Stripe + Clrek",
    "link":"https://www.youtube.com/watch?v=jU8k6WwgaeQ",
    "img" : "https://raw.githubusercontent.com/dananjaya6005/dhananjaya.tech/main/src/post%20thumbnail/GiftofHope.png",
    "description": "Welcome to our platform, a lifeline for economically challenged students and children in Sri Lanka. We provide a unique opportunity for you to make a difference. Create donation events and contribute using Visa, Mastercard, or other online payment methods. We ensure transparency with an admin feature tracking payment history and managing users. Sign up today with a verified email address and join us in transforming lives. Stay tuned for exciting new features! "
  },
  {
    "title": "Lanka News App",
    "tools": "React Native + Web Scraping",
    "link":"https://github.com/dananjaya6005/Lanka-News-app.git",
    "img": "https://raw.githubusercontent.com/dananjaya6005/dhananjaya.tech/main/src/post%20thumbnail/lanka%20news.png",
    "description": "This app was developed using React Native and web scraping to display Sinhala news from sources such as Ada Derana, Lankadeepa, BBC, and Mawbima. The app also utilizes RapidAPI to access various APIs and enhance its functionality. With its user-friendly interface and comprehensive coverage of current events, this app is a must-have for anyone looking to stay informed about the latest news in Sri Lanka. "
  },
  {
    "title": "React Native auth + Clerk",
    "tools": "React Native | Clerk",
    "link":"https://github.com/dananjaya6005/Clrek-auth-with-expo.git",
    "img" : "https://raw.githubusercontent.com/dananjaya6005/dhananjaya.tech/main/src/post%20thumbnail/clrek_auth_post_web.jpg",
    "description": "I have created an app using React Native, Expo, and Clerk to test authentication. The app takes the user’s email, password, first name, and last name. After entering this information, an OTP code is sent to the user’s email. Once the user enters the correct code, they can log in. The best part is that once the user logs in, they don’t need to log in over and over again."
  },
  {
    "title": "Dream Travel",
    "tools": "Android Studio | Firebase",
    "link":"https://github.com/dananjaya6005/dream_travel_android_app.git",
    "img" : "https://raw.githubusercontent.com/dananjaya6005/dhananjaya.tech/main/src/post%20thumbnail/dream%20travel.jpg",
    "description": "This project involves the development of a mobile application using Android Studio that aims to enhance the travel experience for users. The app provides a range of features designed to address common challenges and problems faced by travellers. Travelers often struggle to find reliable and up-to-date information about travel-related news, local services, and attractions when visiting a new city or country "
  },
  {
    "title": "Weather app",
    "tools": "React native + API",
    "link":"https://github.com/dananjaya6005/weather-app.git",
    "img" : "https://raw.githubusercontent.com/dananjaya6005/dhananjaya.tech/main/src/post%20thumbnail/weather_app.png",
    "description": "This app is build with to display real-time weather information with current location based.the app automatically adjusts its design based on day and night, providing a visually pleasing experience. In addition to displaying the current weather, the app also includes a 10-day forecast feature, allowing users to plan ahead"
  },
  {
    "title": "Google Book search app",
    "tools": "React native + Graphql",
    "img" : "https://raw.githubusercontent.com/dananjaya6005/dhananjaya.tech/main/src/post%20thumbnail/goole%20book%20seach%20app.jpg",
    "description": "This app allows users to search for books using the Google Books API, a public API that is free for anyone to use. The app utilizes StepZen GraphQL to seamlessly integrate the Google Books API and provide users with a fast and efficient book search experience. With its user-friendly interface and powerful search capabilities, this app is a must-have for book lovers everywhere.",
    "link" : "https://drive.google.com/file/d/1ypebj36ao13JSdCQepFeQ5UEDNyGlIFa/view?usp=drivesdk"
  },
  {
    "title": "Black Rose vs code Theme",
    "tools": "Visual studio Theme",
    "img" : "https://raw.githubusercontent.com/dananjaya6005/dhananjaya.tech/main/src/post%20thumbnail/vscode%20theme.png",
    "description": "This project is a VS Code theme that features a dark pink color scheme. The theme is available for free on the VS Code Marketplace, where users can easily download and install it. With its eye-catching design and user-friendly interface, this theme is a great choice for anyone looking to add a touch of style to their coding environment.",
    "link" : "https://github.com/dananjaya6005/Black-Rose-vs-code-theme.git"
  }

]




